import React from "react";

export const pageIndex = [
    {
        name: '메인 페이지',
        pages: {link: '/containers/main', title: 'main'},

    },
    {
        name: '테스트',
        pages: {link: '/containers/test', title: 'test'},

    },
]
/* 모의 모음 */

export const test = [
    {
        name: '2011年7月模擬試験',
        n1v: [
            {
                title: (
                    <>
                        問題1 <u className={'blank'}>空欄</u>の言葉の読み方として最もよいものを、1 • 2 • 3 • 4から一つ選びなさい。
                    </>
                ),
                question: [
                    {
                        number: 1,
                        q: (
                            <>
                                去年よりが<u>利益</u>わずかに増えた。
                            </>
                        ),
                        a1: 'りし', a2: 'りそく', a3: 'りえき', a4: ' りじゅん'
                    },
                    {
                        number: 2,
                        q: (
                            <>
                                <ruby>橋本
                                    <rt>はしまと</rt>
                                </ruby>
                                選手の活躍で、なんとかピンチを<u>逃れた</u>。
                            </>
                        ),
                        a1: 'のがれた', a2: 'はなれた', a3: 'それた', a4: 'まぬがれた'
                    },
                    {
                        number: 3,
                        q: (
                            <>
                                子どものおもちゃは、安全性を<u>考慮</u>して選ぶようにしている。
                            </>
                        ),
                        a1: 'こうろ', a2: 'こうりょ', a3: 'こうろう', a4: 'こうりょう'
                    },
                    {
                        number: 4,
                        q:
                            (
                                <>
                                    この辺りは視界を<u>遮る</u>物が何もない。
                                </>
                            )
                        ,
                        a1: 'さまたげる', a2: 'さえぎる', a3: 'せばめる', a4: 'へだてる'
                    },
                    {
                        number: 5,
                        q:
                            (
                                <>
                                    この説は科学的な<u>根拠</u>に乏しい。
                                </>
                            )
                        ,
                        a1: 'こんしょ', a2: 'こんじょ', a3: 'こんきょ', a4: 'こんぎょ'
                    },
                    {
                        number: 6,
                        q:
                            (
                                <>
                                    何事も初めが<u>肝心</u>だ。
                                </>
                            ),
                        a1: 'たんしん', a2: 'かんしん', a3: 'たんじん', a4: 'かんじん'
                    },
                ]
            },
            {
                title: (
                    <>
                        問題2 (&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)に入れるのに最もよいものを、1 • 2 • 3 • 4から一つ選びなさい。
                    </>
                ),
                question: [
                    {
                        number: 7,
                        q:
                            (
                                <>
                                    物置の隅で、ほこり(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)になっている古い人形を見つけた。
                                </>
                            ),
                        a1: 'ぐるみ', a2: 'がらみ', a3: 'まみれ', a4: 'ずくめ'
                    },
                    {
                        number: 8,
                        q:
                            (
                                <>
                                    <ruby>木村
                                        <rt>きむら</rt>
                                    </ruby>
                                    さんとは共通の趣味があるので、いつも会話が(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)。
                                </>
                            ),
                        a1: '舞う', a2: ' 弾む', a3: '転がる', a4: '跳ねる'
                    },
                    {
                        number: 9,
                        q:
                            (
                                <>
                                    地域の(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)に合った医療のシステムが求められている。
                                </>
                            ),
                        a1: '実情', a2: '実況', a3: '実権', a4: '実在'
                    },
                    {
                        number: 10,
                        q:
                            (
                                <>
                                    その選手は、十年に一人の(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)だと言われている。
                                </>
                            ),
                        a1: (
                            <ruby>玄人
                                <rt>くろうと</rt>
                            </ruby>
                        ),
                        a2: (
                            <ruby>大家
                                <rt>たいか</rt>
                            </ruby>
                        ),
                        a3: (
                            <ruby>巨匠
                                <rt>きょしょう</rt>
                            </ruby>
                        ),
                        a4: (
                            <ruby>逸材
                                <rt>いつざい</rt>
                            </ruby>
                        )
                    },
                    {
                        number: 11,
                        q:
                            (
                                <>
                                    書類に(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)があった場合、 申請は受理されません。
                                </>
                            ),
                        a1: '不穏', a2: '不当', a3: '不備', a4: '不順'
                    },
                    {
                        number: 12,
                        q:
                            (
                                <>
                                    約300年前の絵画の(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)が終わり、来月から公開される予定だ。
                                </>
                            ),
                        a1: '回復', a2: '修復', a3: '復旧', a4: '復興'
                    },
                    {
                        number: 13,
                        q:
                            (
                                <>
                                    経済だけでなぐ、法律にも詳しいのが彼の(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)だ。
                                </>
                            ),
                        a1: '深み', a2: '強み', a3: '高み', a4: '重み'
                    },
                ]
            },
            {
                title: (
                    <>
                        問題3 <u className={'blank'}>空欄</u>の言葉に意味が最も近いものを、1 • 2 • 3 • 4から一つ選びなさい。
                    </>
                ),
                question: [
                    {
                        number: 14,
                        q:
                            (
                                <>
                                    この映画は<u>画期的な</u>手法で製作された。
                                </>
                            ),
                        a1: '広く知られている', a2: '最近ではめずらしい', a3: '非常に時間がかかる', a4: '今までになく新しい'
                    },
                    {
                        number: 15,
                        q: (
                            <>
                                あの企業は海外市場への進出を<u>もくろんで</u>いる。
                            </>
                        ),
                        a1: '計画して', a2: '果たして', a3: '開始して', a4: 'あきらめて'
                    },
                    {
                        number: 16,
                        q:
                            (
                                <>
                                    問題を解決するために、もう少し<u>手がかり</u>が欲しい。
                                </>
                            ),
                        a1: 'イメージ', a2: 'サポート', a3: 'チヤンス', a4: 'ヒント'
                    },
                    {
                        number: 17,
                        q:
                            (
                                <>
                                    あの人の話は<u>にわかには</u>信しられない。
                                </>
                            ),
                        a1: 'すぐには', a2: '完全には', a3: 'すなおには', a4: '簡単には'
                    },
                    {
                        number: 18,
                        q: (
                            <>
                                この
                                <ruby>鍋
                                    <rt>なべ</rt>
                                </ruby>
                                は<u>重宝している</u>。
                            </>
                        ),
                        a1: '以前より値上がりしている', a2: '形が気に入っている', a3: '評価が高まっている', a4: '便利で役に立っている'
                    },
                    {
                        number: 19,
                        q: (
                            <>
                                <ruby>中村
                                    <rt>なかむら</rt>
                                </ruby>
                                さんは仕事に対していつも<u>シビアだ</u>。
                            </>
                        ),
                        a1: '弱気だ', a2: '厳しい', a3: '柔軟だ', a4: '注意深い'
                    },
                ]
            },
            {
                title: (
                    <>
                        問題4 次の言葉の使い方として最もよいものを、1 • 2 ・ 3 • 4 から一つ選びなさい。
                    </>
                ),
                question: [
                    {
                        number: 20,
                        q: '連携',
                        a1: (
                            <>
                                学校は地域と<u>連携</u>して生徒の安全を守っている。
                            </>
                        ), a2: (
                            <>
                                複数の社員で一台のプリンターを<u>連携</u>して使っている。
                            </>
                        ), a3: (
                            <>
                                最近の株価は、為替レートと<u>連携</u>して上下している。
                            </>
                        )
                        , a4: (
                            <>
                                登山のときには、必ず地図を<u>連携</u>してください。
                            </>
                        )
                    },
                    {
                        number: 21,
                        q: '不服',
                        a1: (
                            <>
                                彼の失礼な態度は、そこにいた人々の<u>不服</u>を買った。
                            </>
                        ), a2: (
                            <>
                                カラオケで思い切り歌って、日ごろの<u>不服</u>を晴らそう。
                            </>
                        ), a3: (
                            <>
                                審判の判定に<u>不服</u>を唱えることはできない。
                            </>
                        )
                        , a4: (
                            <>
                                この部署で、お客様からの<u>不服</u>を受け付けています。
                            </>
                        )
                    },
                    {
                        number: 22,
                        q: 'かなう',
                        a1: (
                            <>
                                苦労が<u>かない</u>、彼は俳優として成功をおさめた。
                            </>
                        ), a2: (
                            <>
                                天気予報が<u>かない</u>、今日は一日中快晴だった。
                            </>
                        ), a3: (
                            <>
                                準備を重ねてきたイベントが無事<u>かなった</u>。
                            </>
                        )
                        , a4: (
                            <>
                                自分の店を持つという夢が、とうとう<u>かなった</u>。
                            </>
                        )
                    },
                    {
                        number: 23,
                        q: '目覚ましい',
                        a1: (
                            <>
                                あの新人選手は<u>目覚ましい</u>成長を見せている。
                            </>
                        ), a2: (
                            <>
                                上の階で<u>目覚ましい</u>ほどの大きな物音がした。
                            </>
                        ), a3: (
                            <>
                                この赤はとても<u>目覚ましい</u>色で人目をひくね。
                            </>
                        )
                        , a4: (
                            <>
                                夕べ早く寝たので、今朝はとても<u>目覚ましい</u>。
                            </>
                        )
                    },
                    {
                        number: 24,
                        q: 'ほどける',
                        a1: (
                            <>
                                ねじが<u>ほどけて</u>、イスがぐらぐらしている。
                            </>
                        ), a2: (
                            <>
                                靴のひもが<u>ほどけない</u>ようにしっかりと結んだ。
                            </>
                        ), a3: (
                            <>
                                シャツのボタンが<u>ほどけて</u>いるから、とめた方がいいよ。
                            </>
                        )
                        , a4: (
                            <>
                                グラスに浮かぶ氷がみるみるうちに<u>ほどけた</u>。
                            </>
                        )
                    },
                    {
                        number: 25,
                        q: '赴任',
                        a1: (
                            <>
                                明日から三日間
                                <ruby>東京
                                    <rt>ようきょう</rt>
                                </ruby>へ<u>赴任</u>しなければならない。
                            </>
                        ), a2: (
                            <>
                                新入社員の研修では、実際に売り場にも<u>赴任</u>してもらう。
                            </>
                        ), a3: (
                            <>
                                部長が海外の支社に<u>赴任</u>するので、みんなで送別会を開いた。
                            </>
                        )
                        , a4: (
                            <>
                                <ruby>田中
                                    <rt>たなか</rt>
                                </ruby>
                                氏が新しい社長に<u>赴任</u>することが発表された。
                            </>
                        )
                    },
                ]
            }
        ],
        n1g: [
            {
                title: (
                    <>
                        問題5 次の文の(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)に入れるのに最もよいものを、1・2・3・4から一つ選びなさい。
                    </>
                ),
                question: [
                    {
                        number: 26,
                        q: (
                            <>

                            </>
                        ),
                        a1: '', a2: '', a3: '', a4: ' '
                    },
                    {
                        number: 27,
                        q: (
                            <>

                            </>
                        ),
                        a1: '', a2: '', a3: '', a4: ' '
                    },
                    {
                        number: 28,
                        q: (
                            <>

                            </>
                        ),
                        a1: '', a2: '', a3: '', a4: ' '
                    },
                    {
                        number: 29,
                        q: (
                            <>

                            </>
                        ),
                        a1: '', a2: '', a3: '', a4: ' '
                    },
                    {
                        number: 30,
                        q: (
                            <>

                            </>
                        ),
                        a1: '', a2: '', a3: '', a4: ' '
                    },
                    {
                        number: 31,
                        q: (
                            <>

                            </>
                        ),
                        a1: '', a2: '', a3: '', a4: ' '
                    },
                    {
                        number: 32,
                        q: (
                            <>

                            </>
                        ),
                        a1: '', a2: '', a3: '', a4: ' '
                    },
                    {
                        number: 33,
                        q: (
                            <>

                            </>
                        ),
                        a1: '', a2: '', a3: '', a4: ' '
                    },
                ]
            },
        ],
    },
    {
        name: '2011年7月模擬試験',
        n1v: [

        ],
        n1g: [

        ],
    },
]
